stm32-hotspot/STM32WB-BLE-Interoperability-Test/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_IOT_TEST/STM32_WPAN/App/app_ble.c
void hci_cmd_resp_release(uint32_t Flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

void hci_cmd_resp_wait(uint32_t Timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

static void BLE_UserEvtRx(void *p_Payload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *p_param;

  p_param = (tHCI_UserEvtRxParam *)p_Payload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(p_param->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    p_param->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    p_param->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t Status)
{
  uint32_t task_id_list;
  switch (Status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdBusy */

      /* USER CODE END HCI_TL_CmdBusy */
      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdAvailable */

      /* USER CODE END HCI_TL_CmdAvailable */
      break;

    default:
      /* USER CODE BEGIN Status */

      /* USER CODE END Status */
      break;
  }

  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();

  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void BLE_SVC_L2CAP_Conn_Update_Slave_Latency(void)
{
  float Conn_Interval[6] = {48.75,48.75,200,200,1000};
  uint8_t Slave_Latency_Table[6] = {2,4,2,4,1};
  float Sup_TO_Table[9] = {0x258, 0x258, 0x258, 0x258, 0x3C8};
  float Supervision_Timeout;


/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

/* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */
  if(mutex == 1) {
    mutex = 0;
    uint16_t interval_min = CONN_P(Conn_Interval[counterc]);
    uint16_t interval_max = CONN_P(Conn_Interval[counterc]);
    uint16_t slave_latency = Slave_Latency_Table[counters];
    uint16_t timeout_multiplier = (uint16_t)Sup_TO_Table[counterc];
    tBleStatus result;

    result = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                       interval_min, interval_max,
                                                       slave_latency, timeout_multiplier);
    if( result == BLE_STATUS_SUCCESS )
    {
      APP_DBG_MSG(" CONNECTION UPDATE REQUEST \n");
      APP_DBG_MSG("INTERVAL = %.2f ms \n",Conn_Interval[counterc]);
      APP_DBG_MSG("LATENCY = 0x%x \n",slave_latency);
      Supervision_Timeout = Sup_TO_Table[counterc] * 10; //timeout_multiplier * 10;
      APP_DBG_MSG("SUPERVISION_TIMEOUT = %.2f ms \r\n\r",Supervision_Timeout);
      if (counterc < 4)
      {
        counterc++;
        counters++;
      }
      else
      {
        counterc = 0;
        counters = 0;
      }
    }
    else
    {
#if(CFG_DEBUG_APP_TRACE != 0)
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
#endif
    }
  }
/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

/* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */
  return;
}

void BLE_SVC_Security_Req(void)
{
    tBleStatus result;

    result = aci_gap_slave_security_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
    if (result == BLE_STATUS_SUCCESS)
    {
#if(CFG_DEBUG_APP_TRACE != 0)
      APP_DBG_MSG("aci_gap_slave_security_req(), Successfully \r\n\r");
#endif
    }
    else
    {
#if(CFG_DEBUG_APP_TRACE != 0)
      APP_DBG_MSG("aci_gap_slave_security_req(), Failed \r\n\r");
#endif
    }
    return;

}

void BLE_SVC_GAP_Clear_DataBase(void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  ret = aci_gap_clear_security_db();
  if (ret == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("clear security db cmd OK ok\n");
  }
  else
  {
    APP_DBG_MSG("clear security db  cmd NOK\n");
  }
}
/* USER CODE END FD_WRAP_FUNCTIONS */
